summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_regdef.h
/** \\brief  EVR13 SD Coefficient Register 2 */
typedef struct _Ifx_SCU_EVRSDCOEFF2_Bits
{
    unsigned int SD33P:8;                   /**< \brief [7:0] P Coefficient (rw) */
    unsigned int SD33I:8;                   /**< \brief [15:8] I Coefficient (rw) */
    unsigned int SD33D:8;                   /**< \brief [23:16] D Coefficient (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF2_Bits;

/** \\brief  EVR13 SD Coefficient Register 3 */
typedef struct _Ifx_SCU_EVRSDCOEFF3_Bits
{
    unsigned int CT5REG0:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG1:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int CT5REG2:8;                 /**< \brief [23:16] Commutation trimming (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF3_Bits;

/** \\brief  EVR13 SD Coefficient Register 4 */
typedef struct _Ifx_SCU_EVRSDCOEFF4_Bits
{
    unsigned int CT5REG3:8;                 /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT5REG4:8;                 /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF4_Bits;

/** \\brief  EVR13 SD Coefficient Register 5 */
typedef struct _Ifx_SCU_EVRSDCOEFF5_Bits
{
    unsigned int CT33REG0:8;                /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT33REG1:8;                /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int CT33REG2:8;                /**< \brief [23:16] Commutation trimming (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF5_Bits;

/** \\brief  EVR13 SD Coefficient Register 6 */
typedef struct _Ifx_SCU_EVRSDCOEFF6_Bits
{
    unsigned int CT33REG3:8;                /**< \brief [7:0] Commutation trimming (rw) */
    unsigned int CT33REG4:8;                /**< \brief [15:8] Commutation trimming (rw) */
    unsigned int reserved_16:15;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF6_Bits;

/** \\brief  EVR13 SD Control Register 1 */
typedef struct _Ifx_SCU_EVRSDCTRL1_Bits
{
    unsigned int SDFREQSPRD:16;             /**< \brief [15:0] Frequency Spread Threshold (rw) */
    unsigned int SDFREQ:8;                  /**< \brief [23:16] Regulator Switching Frequency (rw) */
    unsigned int SDSTEP:4;                  /**< \brief [27:24] Droop Voltage Step (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int SDSAMPLE:1;                /**< \brief [30:30] ADC Sampling Scheme (rw) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL1_Bits;

/** \\brief  EVR13 SD Control Register 2 */
typedef struct _Ifx_SCU_EVRSDCTRL2_Bits
{
    unsigned int DRVP:8;                    /**< \brief [7:0] P-Driver Setting (rw) */
    unsigned int SDMINMAXDC:8;              /**< \brief [15:8] Minimum Duty Cycle (rw) */
    unsigned int DRVN:8;                    /**< \brief [23:16] N-Driver Setting (rw) */
    unsigned int SDLUT:6;                   /**< \brief [29:24] Non-linear Starting Point (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL2_Bits;

/** \\brief  EVR13 SD Control Register 3 */
typedef struct _Ifx_SCU_EVRSDCTRL3_Bits
{
    unsigned int SDPWMPRE:8;                /**< \brief [7:0] PWM Preset Value (rw) */
    unsigned int SDPID:8;                   /**< \brief [15:8] PID Control (rw) */
    unsigned int SDVOKLVL:8;                /**< \brief [23:16] Configuration of Voltage OK Signal (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL3_Bits;

/** \\brief  EVR13 SD Control Register 4 */
typedef struct _Ifx_SCU_EVRSDCTRL4_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int SYNCDIV:3;                 /**< \brief [10:8] Clock Divider Ratio for external DCDC SYNC signal (rw) */
    unsigned int reserved_11:20;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL4_Bits;

/** \\brief  EVR Status Flag Register */
typedef struct _Ifx_SCU_EVRSTAT_Bits
{
    unsigned int EVR13:1;                   /**< \brief [0:0] EVR13 status (rh) */
    unsigned int OV13:1;                    /**< \brief [1:1] EVR13 Regulator Over-voltage event flag (rh) */
    unsigned int EVR33:1;                   /**< \brief [2:2] EVR33 status (rh) */
    unsigned int OV33:1;                    /**< \brief [3:3] EVR33 Regulator Over-voltage event flag (rh) */
    unsigned int OVSWD:1;                   /**< \brief [4:4] Supply Monitor (SWD) Over-voltage event flag (rh) */
    unsigned int UV13:1;                    /**< \brief [5:5] EVR13 Regulator Under-voltage event flag (rh) */
    unsigned int UV33:1;                    /**< \brief [6:6] EVR33 Regulator Under-voltage event flag (rh) */
    unsigned int UVSWD:1;                   /**< \brief [7:7] Supply Monitor (SWD) Under-voltage event flag (rh) */
    unsigned int EXTPASS13:1;               /**< \brief [8:8] External Pass Device for EVR13 (rh) */
    unsigned int EXTPASS33:1;               /**< \brief [9:9] External Pass Device for EVR33 (rh) */
    unsigned int BGPROK:1;                  /**< \brief [10:10] Primary Bandgap status (rh) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_SCU_EVRSTAT_Bits;

/** \\brief  EVR Under-voltage Configuration Register */
typedef struct _Ifx_SCU_EVRUVMON_Bits
{
    unsigned int EVR13UVVAL:8;              /**< \brief [7:0] 1.3V Regulator Under-voltage threshold (rw) */
    unsigned int EVR33UVVAL:8;              /**< \brief [15:8] 3.3V Regulator Under-voltage threshold (rw) */
    unsigned int SWDUVVAL:8;                /**< \brief [23:16] Supply monitor (SWD) Under-voltage threshold value (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRUVMON_Bits;

/** \\brief  External Clock Control Register */
typedef struct _Ifx_SCU_EXTCON_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] External Clock Enable for EXTCLK0 (rw) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int SEL0:4;                    /**< \brief [5:2] External Clock Select for EXTCLK0 (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int EN1:1;                     /**< \brief [16:16] External Clock Enable for EXTCLK1 (rw) */
    unsigned int NSEL:1;                    /**< \brief [17:17] Negation Selection (rw) */
    unsigned int SEL1:4;                    /**< \brief [21:18] External Clock Select for EXTCLK1 (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int DIV1:8;                    /**< \brief [31:24] External Clock Divider for EXTCLK1 (rw) */
} Ifx_SCU_EXTCON_Bits;

