summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_regdef.h
/** \\brief  Fractional Divider Register */
typedef struct _Ifx_SCU_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:5;             /**< \brief \internal Reserved */
    unsigned int DISCLK:1;                  /**< \brief [31:31] Disable Clock (rwh) */
} Ifx_SCU_FDR_Bits;

/** \\brief  Flag Modification Register */
typedef struct _Ifx_SCU_FMR_Bits
{
    unsigned int FS0:1;                     /**< \brief [0:0] Set Flag INTFx for Channel x (w) */
    unsigned int FS1:1;                     /**< \brief [1:1] Set Flag INTFx for Channel x (w) */
    unsigned int FS2:1;                     /**< \brief [2:2] Set Flag INTFx for Channel x (w) */
    unsigned int FS3:1;                     /**< \brief [3:3] Set Flag INTFx for Channel x (w) */
    unsigned int FS4:1;                     /**< \brief [4:4] Set Flag INTFx for Channel x (w) */
    unsigned int FS5:1;                     /**< \brief [5:5] Set Flag INTFx for Channel x (w) */
    unsigned int FS6:1;                     /**< \brief [6:6] Set Flag INTFx for Channel x (w) */
    unsigned int FS7:1;                     /**< \brief [7:7] Set Flag INTFx for Channel x (w) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int FC0:1;                     /**< \brief [16:16] Clear Flag INTFx for Channel x (w) */
    unsigned int FC1:1;                     /**< \brief [17:17] Clear Flag INTFx for Channel x (w) */
    unsigned int FC2:1;                     /**< \brief [18:18] Clear Flag INTFx for Channel x (w) */
    unsigned int FC3:1;                     /**< \brief [19:19] Clear Flag INTFx for Channel x (w) */
    unsigned int FC4:1;                     /**< \brief [20:20] Clear Flag INTFx for Channel x (w) */
    unsigned int FC5:1;                     /**< \brief [21:21] Clear Flag INTFx for Channel x (w) */
    unsigned int FC6:1;                     /**< \brief [22:22] Clear Flag INTFx for Channel x (w) */
    unsigned int FC7:1;                     /**< \brief [23:23] Clear Flag INTFx for Channel x (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_SCU_FMR_Bits;

/** \\brief  Identification Register */
typedef struct _Ifx_SCU_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_SCU_ID_Bits;

/** \\brief  Flag Gating Register */
typedef struct _Ifx_SCU_IGCR_Bits
{
    unsigned int IPEN00:1;                  /**< \brief [0:0] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN01:1;                  /**< \brief [1:1] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN02:1;                  /**< \brief [2:2] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN03:1;                  /**< \brief [3:3] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN04:1;                  /**< \brief [4:4] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN05:1;                  /**< \brief [5:5] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN06:1;                  /**< \brief [6:6] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int IPEN07:1;                  /**< \brief [7:7] Flag Pattern Enable for Channel 0 (rw) */
    unsigned int reserved_8:5;              /**< \brief \internal Reserved */
    unsigned int GEEN0:1;                   /**< \brief [13:13] Generate Event Enable 0 (rw) */
    unsigned int IGP0:2;                    /**< \brief [15:14] Interrupt Gating Pattern 0 (rw) */
    unsigned int IPEN10:1;                  /**< \brief [16:16] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN11:1;                  /**< \brief [17:17] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN12:1;                  /**< \brief [18:18] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN13:1;                  /**< \brief [19:19] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN14:1;                  /**< \brief [20:20] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN15:1;                  /**< \brief [21:21] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN16:1;                  /**< \brief [22:22] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int IPEN17:1;                  /**< \brief [23:23] Interrupt Pattern Enable for Channel 1 (rw) */
    unsigned int reserved_24:5;             /**< \brief \internal Reserved */
    unsigned int GEEN1:1;                   /**< \brief [29:29] Generate Event Enable 1 (rw) */
    unsigned int IGP1:2;                    /**< \brief [31:30] Interrupt Gating Pattern 1 (rw) */
} Ifx_SCU_IGCR_Bits;

/** \\brief  ESR Input Register */
typedef struct _Ifx_SCU_IN_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Input Bit x (rh) */
    unsigned int P1:1;                      /**< \brief [1:1] Input Bit x (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SCU_IN_Bits;

/** \\brief  Input/Output Control Register */
typedef struct _Ifx_SCU_IOCR_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int PC0:4;                     /**< \brief [7:4] Control for ESR Pin x (rw) */
    unsigned int reserved_8:4;              /**< \brief \internal Reserved */
    unsigned int PC1:4;                     /**< \brief [15:12] Control for ESR Pin x (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_IOCR_Bits;

/** \\brief  Logic BIST Control 0 Register */
typedef struct _Ifx_SCU_LBISTCTRL0_Bits
{
    unsigned int LBISTREQ:1;                /**< \brief [0:0] LBIST Request (w) */
    unsigned int LBISTREQP:1;               /**< \brief [1:1] LBIST Request Protection Bit (w) */
    unsigned int PATTERNS15_2:14;           /**< \brief [15:2] LBIST Pattern Number (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_LBISTCTRL0_Bits;

/** \\brief  Logic BIST Control 1 Register */
typedef struct _Ifx_SCU_LBISTCTRL1_Bits
{
    unsigned int SEED:23;                   /**< \brief [22:0] LBIST Seed (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int SPLITSH:3;                 /**< \brief [26:24] LBIST Split-Shift Selection (rw) */
    unsigned int BODY:1;                    /**< \brief [27:27] Body Application Indicator (rw) */
    unsigned int LBISTFREQU:4;              /**< \brief [31:28] LBIST Frequency Selection (rw) */
} Ifx_SCU_LBISTCTRL1_Bits;

