summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxScu_regdef.h
/** \\brief  CCU Clock Control Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON2_Bits B;
} Ifx_SCU_CCUCON2;

/** \\brief  CCU Clock Control Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON3_Bits B;
} Ifx_SCU_CCUCON3;

/** \\brief  CCU Clock Control Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON4_Bits B;
} Ifx_SCU_CCUCON4;

/** \\brief  CCU Clock Control Register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON5_Bits B;
} Ifx_SCU_CCUCON5;

/** \\brief  CCU Clock Control Register 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON6_Bits B;
} Ifx_SCU_CCUCON6;

/** \\brief  CCU Clock Control Register 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON7_Bits B;
} Ifx_SCU_CCUCON7;

/** \\brief  CCU Clock Control Register 9 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON9_Bits B;
} Ifx_SCU_CCUCON9;

/** \\brief  CCU Control Security Monitor Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCONSM_Bits B;
} Ifx_SCU_CCUCONSM;

/** \\brief  Chip Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CHIPID_Bits B;
} Ifx_SCU_CHIPID;

/** \\brief  Die Temperature Sensor Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_DTSCON_Bits B;
} Ifx_SCU_DTSCON;

/** \\brief  Die Temperature Sensor Limit Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_DTSLIM_Bits B;
} Ifx_SCU_DTSLIM;

/** \\brief  Die Temperature Sensor Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_DTSSTAT_Bits B;
} Ifx_SCU_DTSSTAT;

/** \\brief  External Input Channel Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EICR_Bits B;
} Ifx_SCU_EICR;

/** \\brief  External Input Flag Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EIFR_Bits B;
} Ifx_SCU_EIFR;

/** \\brief  Emergency Stop Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EMSR_Bits B;
} Ifx_SCU_EMSR;

/** \\brief  ESR Input Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_ESRCFG_Bits B;
} Ifx_SCU_ESRCFG;

/** \\brief  ESR Output Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_ESROCFG_Bits B;
} Ifx_SCU_ESROCFG;

/** \\brief  EVR13 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVR13CON_Bits B;
} Ifx_SCU_EVR13CON;

/** \\brief  EVR33 Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVR33CON_Bits B;
} Ifx_SCU_EVR33CON;

/** \\brief  EVR ADC Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRADCSTAT_Bits B;
} Ifx_SCU_EVRADCSTAT;

/** \\brief  EVR Monitor Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRMONCTRL_Bits B;
} Ifx_SCU_EVRMONCTRL;

/** \\brief  EVR Over-voltage Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVROVMON_Bits B;
} Ifx_SCU_EVROVMON;

/** \\brief  EVR Hard Reset Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRRSTCON_Bits B;
} Ifx_SCU_EVRRSTCON;

/** \\brief  EVR13 SD Coefficient Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRSDCOEFF1_Bits B;
} Ifx_SCU_EVRSDCOEFF1;

/** \\brief  EVR13 SD Coefficient Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRSDCOEFF2_Bits B;
} Ifx_SCU_EVRSDCOEFF2;

/** \\brief  EVR13 SD Coefficient Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_EVRSDCOEFF3_Bits B;
} Ifx_SCU_EVRSDCOEFF3;

